<a href="https://colab.research.google.com/github/samirlenka/pandas_exercises/blob/master/05_Merge/Housing%20Market/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [12]:
s1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = 'l'))
s2 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = 'l'))
s3 = pd.Series(np.random.randint(10000, high = 30001, size = 100, dtype = 'l'))
print(s1.head(5), '\n')
print(s2.head(5), '\n')
print(s3.head(5), '\n')

0    1
1    2
2    3
3    2
4    3
dtype: int64

0    3
1    2
2    1
3    2
4    2
dtype: int64

0    22127
1    11676
2    27760
3    28917
4    24750
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [16]:
housemkt = pd.concat([s1, s2, s3], axis = 1)
housemkt.head(10)

   0  1      2
0  1  3  22127
1  2  2  11676
2  3  1  27760
3  2  2  28917
4  3  2  24750
5  2  2  13692
6  2  1  28253
7  1  1  15805
8  2  2  10285
9  4  2  15711

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [23]:
housemkt.rename(columns = {0 : 'bedrs', 1 : 'bathrs', 2 : 'price_sq_meter'}, inplace = True)
housemkt.head()

   bedrs  bathrs  price_sq_meter
0      1       3           22127
1      2       2           11676
2      3       1           27760
3      2       2           28917
4      3       2           24750

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [32]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis = 0)
bigcolumn.head()

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn.head()

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  2
2  3
3  2
4  3

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [33]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [35]:
bigcolumn.reset_index(drop = True, inplace = True)
bigcolumn

         0
0        1
1        2
2        3
3        2
4        3
..     ...
295  19914
296  17196
297  11397
298  12904
299  22737

[300 rows x 1 columns]